<a href="https://colab.research.google.com/github/ltoosaint24/DS-Unit-3-Sprint-2-SQL-and-Databases/blob/master/northwind_py.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Part II- Northwid Database

In [ ]:
import sqlite3
import numpy as numy
import pandas as pd
import random

In [ ]:
xon = sqlite3.connect('/content/northwind_small.sqlite3')

In [ ]:
xo = xon.cursor()

In [ ]:

DF = pd.read_sql_query('SELECT * FROM OrderDetail GROUP BY UnitPrice ORDER BY UnitPrice DESC  LIMIT 10', xon)
print(DF)
expensive_items =DF.head(10)

         Id  OrderId  ProductId  UnitPrice  Quantity  Discount
0  11032/38    11032         38     263.50        25      0.00
1  10479/38    10479         38     210.80        30      0.00
2  11030/29    11030         29     123.79        60      0.25
3  10465/29    10465         29      99.00        18      0.10
4   10848/9    10848          9      97.00         3      0.00
5  11077/20    11077         20      81.00         1      0.04
6   10420/9    10420          9      77.60        20      0.10
7  10384/20    10384         20      64.80        28      0.00
8  11053/18    11053         18      62.50        35      0.20
9  11036/59    11036         59      55.00        30      0.00

In [ ]:
emp =pd.read_sql_query('SELECT Avg(HireDate-Birthdate) FROM Employee',xon)
print(emp.columns)
print(emp)
avg_hire_age = emp
print(avg_hire_age)

Index(['Avg(HireDate-Birthdate)'], dtype='object')
   Avg(HireDate-Birthdate)
0                37.222222
   Avg(HireDate-Birthdate)
0                37.222222

In [ ]:
er = pd.read_sql_query('Select city, AVG(HireDate -Birthdate) from Employee GROUP BY city',xon)
avg_age_by_city = print(er)

       City  AVG(HireDate -Birthdate)
0  Kirkland                      29.0
1    London                      32.5
2   Redmond                      56.0
3   Seattle                      40.0
4    Tacoma                      40.0

In [ ]:
pd.read_sql_query('Select EmployeeId, Count(TerritoryId) from EmployeeTerritory GROUP BY EmployeeId ORDER BY Count(TerritoryId) DESC',xon)

   EmployeeId  Count(TerritoryId)
0           7                  10
1           2                   7
2           5                   7
3           9                   7
4           6                   5
5           3                   4
6           8                   4
7           4                   3
8           1                   2

In [ ]:
dff = pd.read_sql_query('SELECT Supplier.CompanyName, OrderDetail.Id, OrderDetail.OrderId, OrderDetail.ProductId, OrderDetail.UnitPrice FROM OrderDetail, Supplier WHERE OrderDetail.Id = Supplier.Id  GROUP BY UnitPrice ORDER BY OrderDetail.UnitPrice DESC  LIMIT 10', xon)
print(dff)
expensive_items =dff.head(10)
ten_most_expensive = print(dff)

Empty DataFrame
Columns: [CompanyName, Id, OrderId, ProductId, UnitPrice]
Index: []
Empty DataFrame
Columns: [CompanyName, Id, OrderId, ProductId, UnitPrice]
Index: []

In [ ]:
largest_category=pd.read_sql_query('Select CategoryName, MAX(Description) from Category',xon)
print(largest_category)

  CategoryName                                   MAX(Description)
0   Condiments  Sweet and savory sauces, relishes, spreads, an...

In [ ]:
most_territories = pd.read_sql_query('Select EmployeeId, Count(TerritoryId) from EmployeeTerritory GROUP BY EmployeeId ORDER BY Count(TerritoryId) DESC',xon)
print(most_territories)

   EmployeeId  Count(TerritoryId)
0           7                  10
1           2                   7
2           5                   7
3           9                   7
4           6                   5
5           3                   4
6           8                   4
7           4                   3
8           1                   2

Part IV - Questions

1. The Territory table can be considered to be another class table, while it may contain subclass items, such as TerritoryId can be utilized as connecting variables in subclass tables within Employee, such as EmployeeTerritory tables.

2.MongoDB is appropriate within maintianing large data sets, or Big Data. It may not be suitable for the database that require direct access.

3.NewSQL is a way of reformating how database are stored. This usually intends to create various environment that supports the storage of databased when dealing with big data sets. They are associated within new SQL database platforms.